{
	"_id": "14469680",
	"site": "https://github.com/UFOID/UFO-Detector",
	"title": " UFO Detector – Capturing Aerial Anomalies Using Computer Vision",
	"author": "markth",
	"date": "2017-06-13T13:05:02.705Z",
	"tags": {
		"categories": [
			"opensource"
		],
		"languages": [
			"c++",
			"qmake",
			"other"
		]
	},
	"content": "readme.md ufo detector ufo detector is software allows autonomous video recording unidentifiable flying objects. includes unknown aircrafts, meteors other aerial anomalies. is designed detect record objects cannot identified something known during day night. it actionfeatures:autonomous video recording possible ufosinterface manage the recorded videossharing captured video ufoid.netselection specific detection areacurrently support windows linux. raspberry pi has been planned (https://github.com/ufoid/ufo-detecor-pi).requirements:usb webcamopencv 3.0 (2.4.8 work ubuntu 14, 3.1.0 is required ubuntu >=15)qt 5ffmpeg / avconvtodo:interface support more video devicesimprove detection algorithmmany bug fixesbuilding running, get source code ufo detector either cloning repository downloading source a zip package. the \"clone download\" button above.windowsinstall prerequisites, the list above.open project file ...\\ufo-detector\\ui-qt\\detector.pro qt creator. edit opencv paths opencv.pri they point correct locations.build project. can run application qt creator from command line the build directory.generic notes building linux your distribution has opencv version than 2.4.9 through 3.0.0, should able build ufo detector the development packages the normal repositories. that case, read instructions ubuntu linux 14 apply to distribution. ufo detector has problem writing videos correctly know have buggy version opencv, which case read next paragraph.opencv versions between 2.4.9 through 3.0.0 a bug, least ubuntu linux, causing video writing fail. means opencv >=3.1.0 need be installed hand. that, read instructions ubuntu linux >=15 apply to distribution.ubuntu linux 14, install qt5, avconv/ffmpeg, opencv development packages:sudo apt- install qtbase5-dev libav-tools libopencv-dev qt5-default this is enough, check you need install development packages well.open project file .../ufo-detector/ui-qt/detector.pro qt creator build . you run application qt creator from command line the build directory.ubuntu linux >=15 ubuntu linux >=15, install qt5 avconv/ffmpeg, plus necessary packages compiling opencv. installing libopencv-dev package is optional it not used.sudo apt- install qtbase5-dev libav-tools build-essential cmake libgtk2.0-dev pkg-config libavcodec-dev libavformat-dev libswscale-dev qt5-defaultnext, download opencv 3.1.0 source package linux unzip . it's assumed here target folder is opencv-3.1.0. run following commands the same folder which unzipped source package:mkdir opencv-3.1.0-buildcd opencv-3.1.0-buildcmake -d cmake_build_type=release -d with_ipp=off -d cmake_install_prefix=/usr/local ../opencv-3.1.0sudo installsudo ldconfig you ipp icv, turn on figure to it (didn't out the box). more info opencv, please refer opencv building instructions.open project file .../ufo-detector/ui-qt/detector.pro qt creator build . you run application qt creator from command line the build directory.detection algorithm:since objects the software looks are well defined (.e. being unknown) false positive detections are expected. use combination following algorithms order narrow down results:motion detection: program looks moving objects within selected area detection. user specify size noise will ignored. each moving object is tracked.light detection: assume ufo is light emitting (.e. object being brighter the background) order decrease amount false-positives.object recognition: each detected bright object is analyzed using cascade classifier was trained using images flying birds. is used the detection process is run during day. currently birds are filtered in way.aircraft filter: using data the internet check whether are aircrafts within camera view.license:gplv3creditshttps://github.com/smorodov/multitarget-tracker/"
}