{
	"_id": "14513330",
	"site": "https://www.uconomix.com/Products/uMark-PDF/Default.aspx",
	"title": " UMark PDF Watermarker – Batch PDF Watermark Software",
	"author": "yashg",
	"date": "2017-06-14T12:56:09.192Z",
	"tags": [],
	"content": "umark photos | umark video | umark pdf screenshots compare download buy support umark pdf screenshots compare download buy support umark photos umark pdf watermarker batch watermark software pdf documents download pdf watermarking add visible watermarks your pdf documents. put copyright your important documents. batch processing watermark multiple pdf documents once. select individual documents watermark entire folders. text image watermarks add text your logo watermarks. can add multiple watermarks a document. put company name your corporate documents. fully customizable watermarks set font properties the text watermark, choose placement the watermarks, set custom transparency rotation. total control how watermark looks where appears. save watermarks reuse save with saved watermarks. create or more watermarks save for repeat so don't to create from scratch every . insert page numbers insert page numbers total number pages your documents. password protected pdfs add watermarks password protected documents. umark also remove passwords apply passwords pdf documents. free mode you limited number documents watermark, you use umark free. free mode does add of 's own watermarks. here's comparison free vs pro mode. downloadbuy complete feature list * batch watermark multiple pdf documents * watermark entire folder along sub folders * set watermark text * set watermark font, size other font properties bold, italics underline * set watermark color * add shadow watermark improve visibility * set shadow color * watermark macros - document name, folder name, document path, page number, total pages * place watermark one the 9 predefined positions set custom x,y position * set custom transparency * rotate watermark * an image/logo/signature watermark * resize image be used watermark * watermark password protected documents * save watermarks repeat * save watermarked pdf a specific folder the original folder * choose whether overwrite original pdf * add suffix watermarked documents * add password watermarked documents * remove password password protected documentsdownload buy products * umark photo watermarker * umark video watermarker * umark pdf watermarker * umark photo watermarker ios * pdf unlockcompany * * terms & conditions * privacy policy * refunds policy * contactsocialcopyright © 2005-2016 uconomix technologies private limited. rights reserved."
}