{
	"_id": "14410043",
	"site": "https://www.froala.com/wysiwyg-editor/customers/closeio",
	"title": " Why Close.io Chose Froala WYSIWYG HTML Editor for Their CRM",
	"author": "froala",
	"date": "2017-06-16T07:57:55.184Z",
	"tags": [],
	"content": "menu * pricing * demos * docs * support * login * download× don't reinvent wheel. close.ioclose.io is inside sales crm startups smbs increases productivity having your sales communication one place. all started elasticsales, team salespeople doing sales demand around silicon valley. make whole process more efficient, built several internal tools eventually became secret sauce generating millions dollars sales hundreds venture backed silicon valley startups. fortunately, secret sauce is available the entire world a sales software since january 2013. year later, close.io was profitable company today has thousands happy customers. use froala add rich text editing emails sent our platform. phil freoclose.io & froala close.io engineering team used python, javascript (backbone.js react), froala wysiwyg editor develop inbox feature enables users write rich email within close.io app. together phone voicemails, email is of main tools salespeople on daily basis, inbox was designed manage of in place. user interface sending emails was important aspect the inbox feature. however, close.io's intention was never fully replace google mail, rather offer seamless sales email experience their users. this needed wysiwyg html editor: \" wanted spend time adding unique value creating sales-focused tools without having reinvent wheel.\" were looking a complete solution handled text formatting, image uploading, etc. a very polished . phil freocreated successful salespeople salespeople, close.io has suit sales optimization tools, inbox deals everyday seamless emails. froala wysiwyg html editor was key making happen.froala was perfect match having great user experience, -of--box features, very customer support.phil freohead product/engineeringwhy froala? * great user experience * complete solution * of box features * secure * customer support * very fast turnaround reported problems * works emails us * froala * blog * terms * privacy * careerswysiwyg editor * pricing * help center * version 1.2 * migrate v1 * contactlearning * features * innovations * download * docs * examples're social * facebook * twitter * google+ * linkedin * github"
}