{
	"_id": "14503827",
	"site": "https://yakk.io",
	"title": " Yakk – Project Management and Collaboration On-Premises or in the Cloud",
	"author": "_Understated_",
	"date": "2017-06-16T07:56:24.509Z",
	"tags": [],
	"content": "toggle navigation * beta * * contactproject management & collaboration premises | the cloudjoin betayakk is only real- organization tool securely manages your projects simultaneously while streamlining team communication collaboration allowing to eliminate internal email. can installed your premises, just cloud, making yakk secure option. your projects onceyakk shows a single real- view all projects: doesn't matter you are project manager just contributor, anyone see status all projects are involved from single screen, without generating single report.real- project status exactly the entire project team is to. including tasks have started, tasks are complete most importantly tasks are behind schedule. can keep track all milestones the same dashboard access areas the project a single click.real- collaborationnever send another internal email again!yakk features powerful communication collaboration engine allows entire team collaborate real- no matter where are located. can collaborate real- on documents have stored the central project library. death knell email has been sounded.features more emailsview projectsreal- dashboardinstantaneous searchingreal- file collaborationno more reportsreal- project communicationsingle file repositoryreal- team task statuspricing-premisesunlimited projectsunlimited team membersunlimited storage ¹invite anyone search restrictions24/7 email/online support ² £8³cloudunlimited projectsunlimited team membersunlimited storageinvite anyone search restrictions24/7 email/online support ² £12³¹ - storage be dictated your own infrastructure there is restriction within application² - larger orders benefit telephone support dedicated customer support teams³ - price is per person per month is based 12 months frontcopyright © whitehirst limited 2017"
}